Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/external/esp-idf-projects/mipi_dbi_spi_lcd/sdkconfig.defaults
# ESP32-P4 target
CONFIG_IDF_TARGET="esp32p4"

# Enable MIPI-DSI and related peripherals
CONFIG_SOC_MIPI_DSI_HOST_SUPPORTED=y
CONFIG_SOC_LCD_SUPPORTED=y
CONFIG_SOC_SPIRAM_SUPPORTED=y

# PSRAM for framebuffer
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ESP LCD panel support
CONFIG_ESP_LCD_ENABLED=y
CONFIG_ESP_LCD_MIPI_DSI=y
CONFIG_ESP_LCD_DSI_ISR_IRAM_SAFE=y

# Increase main task stack for LCD operations
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Compiler optimizations for performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y
